storage/tests/4a052a05-126b-4436-bcae-f1839a2efcb3/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/user/Desktop/simple load testing/backend/storage/tests/4a052a05-126b-4436-bcae-f1839a2efcb3/script.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s

running (11.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (12.0s), 06/10 VUs, 4 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (13.0s), 04/10 VUs, 6 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (14.0s), 03/10 VUs, 7 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (15.0s), 02/10 VUs, 8 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s

running (16.0s), 01/10 VUs, 9 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  10s


  █ TOTAL RESULTS 

    checks_total.......: 50     3.097371/s
    checks_succeeded...: 80.00% 40 out of 50
    checks_failed......: 20.00% 10 out of 50

    ✗ status ok
      ↳  80% — ✓ 40 / ✗ 10

    HTTP
    http_req_duration..............: avg=192.21ms min=4.3ms  med=8.3ms  max=977.29ms p(90)=670.4ms  p(95)=756.88ms
      { expected_response:true }...: avg=85.88ms  min=4.3ms  med=7.53ms max=369.92ms p(90)=336.33ms p(95)=344.08ms
    http_req_failed................: 20.00% 10 out of 50
    http_reqs......................: 50     3.097371/s

    EXECUTION
    iteration_duration.............: avg=12.95s   min=11.12s med=12.48s max=16.14s   p(90)=15.56s   p(95)=15.85s  
    iterations.....................: 10     0.619474/s
    vus............................: 1      min=1        max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 29 kB  1.8 kB/s
    data_sent......................: 15 kB  928 B/s



running (16.1s), 00/10 VUs, 10 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s